In [ ]:
'''
Pandas
    -> data manipulation library
    -> data analysis & data cleaning
    -> 2 Primary data str: Series & DataFrame
        -> Series = 1D - arrays like object
        -> DF = 2D, size-mutable  
'''

In [1]:
import pandas as pd

In [3]:
# Series
# 1-D array like object, hold any data type
data = [11,22,33,44]
series = pd.Series(data)
series

0    11
1    22
2    33
3    44
dtype: int64

In [5]:
# Create a series from Dictionary
data = {'a':11,'b':22,'c':33}
series_dict = pd.Series(data)
series_dict

a    11
b    22
c    33
dtype: int64

In [6]:
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [8]:
# Create Dataframe from dictionary of list
data = {
    'Name':['Abhi','Kr'],
    'Age':[30,32],
    'Job':['Developer', 'Data Scientist']
}
df = pd.DataFrame(data)
df

   Name  Age             Job
0  Abhi   30       Developer
1    Kr   32  Data Scientist

In [13]:
# Create dataframe using list of dict
data1 = [
    {'Name':'Abhishek','Age':32,'Job':'Developer'},
    {'Name':'Kumar','Age':30,'Job':'Data Scientist'}

]

df1 = pd.DataFrame(data1)
df1

       Name  Age             Job
0  Abhishek   32       Developer
1     Kumar   30  Data Scientist

In [15]:
# DataFrame
df = pd.read_csv(r'data.csv')
print(df.head(5))
print(df.tail(5))

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0
    Duration          Date  Pulse  Maxpulse  Calories
27        60  '2020/12/27'     92       118     241.0
28        60  '2020/12/28'    103       132       NaN
29        60  '2020/12/29'    100       132     280.0
30        60  '2020/12/30'    102       129     380.3
31        60  '2020/12/31'     92       115     243.0

In [17]:
df['Duration'].head()

0    60
1    60
2    60
3    45
4    45
Name: Duration, dtype: int64

In [ ]:
# row index access
df.loc[0]

Duration              60
Date        '2020/12/01'
Pulse                110
Maxpulse             130
Calories           409.1
Name: 0, dtype: object

In [ ]:
#row-col index level access
df.iloc[0]

Duration              60
Date        '2020/12/01'
Pulse                110
Maxpulse             130
Calories           409.1
Name: 0, dtype: object

In [26]:
df.iloc[0][2]

C:\Users\stuar\AppData\Local\Temp\ipykernel_20640\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

np.int64(110)

In [ ]:
#at
print(df.at[1,'Pulse'])
print(df.at[2,'Date'])
print(df.at[1,'Maxpulse'])

117
'2020/12/03'
145

In [30]:
#accessing a specified element using iat
df.iat[2,1]

"'2020/12/03'"

In [33]:
#data manipulation with df
df1.head()

       Name  Age             Job
0  Abhishek   32       Developer
1     Kumar   30  Data Scientist

In [47]:
df1['Salary']=[1000,2000]
df1

       Name  Age             Job  Salary
0  Abhishek   32       Developer    1000
1     Kumar   30  Data Scientist    2000

In [48]:
#remove column
'''
drop = temp operations, to save the state, have to save as inplace = True
axis = 0 -> looks for rows
axis = 1 -> looks for columns
'''
df1.drop('Salary',axis=1)

       Name  Age             Job
0  Abhishek   32       Developer
1     Kumar   30  Data Scientist

In [49]:
df1

       Name  Age             Job  Salary
0  Abhishek   32       Developer    1000
1     Kumar   30  Data Scientist    2000

In [50]:
# update and save the state 
df1.drop(['Salary'],axis = 1, inplace=True)

In [51]:
df1

       Name  Age             Job
0  Abhishek   32       Developer
1     Kumar   30  Data Scientist

In [52]:
df1['Age']+=1
df1

       Name  Age             Job
0  Abhishek   33       Developer
1     Kumar   31  Data Scientist

In [53]:
#drop row permanently
df1.drop(0, inplace=True)

In [54]:
df1

    Name  Age             Job
1  Kumar   31  Data Scientist

In [55]:
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [56]:
#statistcal update
df.describe()

         Duration       Pulse    Maxpulse    Calories
count   32.000000   32.000000   32.000000   30.000000
mean    68.437500  103.500000  128.500000  304.680000
std     70.039591    7.832933   12.998759   66.003779
min     30.000000   90.000000  101.000000  195.100000
25%     60.000000  100.000000  120.000000  250.700000
50%     60.000000  102.500000  127.500000  291.200000
75%     60.000000  106.500000  132.250000  343.975000
max    450.000000  130.000000  175.000000  479.000000